In [21]:
import pandas as pd
import numpy as np
Data = pd.read_csv('C:/Users/Lenovo/Dataset/Titanic-Dataset.csv')

In [22]:
Data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
Data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [24]:
Data = Data.drop(columns = ['PassengerId', 'Name', 'Ticket','Cabin'])

In [25]:
Data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [26]:
Data.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

# Filling the nan values using mean and median and mode values

In [27]:
median = Data['Age'].median()
mean = Data['Age'].mean()
Max = Data['Embarked'].value_counts().idxmax()
Max

'S'

In [28]:
Data['Age'] = Data['Age'].fillna(median)
Data['Embarked'] = Data['Embarked'].fillna(Max)

In [29]:
Data.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [30]:
Data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.361582    0.523008    0.381594   32.204208
std      0.486592    0.836071   13.019697    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   22.000000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   35.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [31]:
Data['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

# Since these are categorical data now convert them into numerical columns

In [32]:
Data = pd.get_dummies(Data, columns = ['Embarked', 'Sex'])

In [33]:
Data.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male
0,0,3,22.0,1,0,7.2500,False,False,True,False,True
1,1,1,38.0,1,0,71.2833,True,False,False,True,False
2,1,3,26.0,0,0,7.9250,False,False,True,True,False
3,1,1,35.0,1,0,53.1000,False,False,True,True,False
4,0,3,35.0,0,0,8.0500,False,False,True,False,True

In [34]:
Data['Company'] = np.where((Data['SibSp'] + Data['Parch'] > 0 ),1 ,0 )

In [35]:
Data = Data.drop(columns = ['SibSp', 'Parch'])

In [36]:
Data.head(2)

,Survived,Pclass,Age,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male,Company
0,0,3,22.0,7.2500,False,False,True,False,True,1
1,1,1,38.0,71.2833,True,False,False,True,False,1

In [37]:
Data['Embarked_C'] = np.where((Data['Embarked_C'] == True), 1, 0)
Data['Embarked_Q'] = np.where((Data['Embarked_Q'] == True), 1, 0)
Data['Embarked_S'] = np.where((Data['Embarked_S'] == True), 1, 0)
Data['Sex_male'] = np.where((Data['Sex_male'] == True), 1, 0)
Data['Sex_female'] = np.where((Data['Sex_female'] == True), 1, 0)

In [38]:
import pandas as pd
data = {
    'city': ['Jacksonville', 'Jacksonville', 'Jacksonville', 'Jacksonville', 'Jacksonville',
             'ElPaso', 'ElPaso', 'ElPaso', 'ElPaso', 'ElPaso'],
    'month': ['January', 'February', 'March', 'April', 'May',
              'January', 'February', 'March', 'April', 'May'],
    'temperature': [13, 23, 38, 5, 34, 20, 6, 26, 2, 43]
}
weather = pd.DataFrame(data)

pivoted = weather.pivot(index='month', columns='city', values='temperature')

print(pivoted)

city      ElPaso  Jacksonville
month
April          2             5
February       6            23
January       20            13
March         26            38
May           43            34